# SetSurfaceBackgroundPatternVisible Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..SetSurfaceBackgroundPatternVisible Method
OverrideGraphicSettings Class See Also
---
Sets the visibility of the surface background fill pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public OverrideGraphicSettings SetSurfaceBackgroundPatternVisible(
	bool fillPatternVisible
)
```

Visual Basic
---
```text
Public Function SetSurfaceBackgroundPatternVisible ( _
	fillPatternVisible As Boolean _
) As OverrideGraphicSettings
```

Visual C++
---
```text
public:
OverrideGraphicSettings^ SetSurfaceBackgroundPatternVisible(
	bool fillPatternVisible
)
```

# ### Parameters
fillPatternVisible
    Type: System..::..Boolean Value of the visibility of the surface background fill pattern.
# ### Return Value
Reference to the changed object.
# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace